package kr.scalar.api.common._sort;

/**
 * packageName: kr.scalar.api.common._sort
 * fileName   : RectangleStarPrint
 * author     : parkjungkwan
 * date       : 2022-05-23
 * desc       : [백준 알고리즘] 2438, 2439, 2440, 2441번 별찍기 문제 https://jhnyang.tistory.com/98
 * [2438번] 별 찍기-1
 *
 * ----------------------------------------------------------------------------------------
 *
 * 문제: 첫째 줄에는 별 1개, 둘째 줄에는 별 2개, N번째 줄에는 별 N개를 찍는 문제.
 *
 * 시간제한: 1초,  메모리 제한 128MB
 *
 * 입력: 첫째 줄에 N(1<= N <= 100)이 주어진다.
 *
 * 출력: 첫째 줄부터 N번째 줄까지 차례대로 별을 출력한다.
 *
 *
 *
 * 예시1
 * 입력: 5
 * 출력:
 * *
 * **
 * ***
 * ****
 * *****
 * ----------------------------------------------------------------------------------------
 * [2439번] 별 찍기-2
 * ----------------------------------------------------------------------------------------
 *
 * 문제: 첫째 줄에는 별 1개, 둘째 줄에는 별 2개, N번째 줄에는 별 N개를 찍는 문제. 하지만 오른쪽을 기준으로 정렬한 별을 출력하시오.
 *
 * 시간제한: 1초,  메모리 제한 128MB
 *
 * 입력: 첫째 줄에 N(1<= N <= 100)이 주어진다.
 *
 * 출력: 첫째 줄부터 N번째 줄까지 차례대로 별을 출력한다.
 *
 *
 *
 * 예시1
 *
 * 입력: 5
 *
 * 출력:
 *     *
 *    **
 *   ***
 *  ****
 * *****
 * [2440번] 별 찍기-3
 * ----------------------------------------------------------------------------------------
 *
 * 문제: 첫째 줄에는 별 N개, 둘째 줄에는 별 N-1개, ... , N번째 줄에는 별 1개를 찍는 문제.
 *
 * 시간제한: 1초,  메모리 제한 128MB
 *
 * 입력: 첫째 줄에 N(1<= N <= 100)이 주어진다.
 *
 * 출력: 첫째 줄부터 N번째 줄까지 차례대로 별을 출력한다.
 *
 * 예시1
 *
 * 입력: 5
 *
 * 출력:
 * *****
 * ****
 * ***
 * **
 * *
 * ----------------------------------------------------------------------------------------
 * [2441번] 별 찍기-4
 * ----------------------------------------------------------------------------------------
 *
 * 문제: 첫째 줄에는 별 1개, 둘째 줄에는 별 N-1개, ... , N번째 줄에는 별 1개를 찍는 문제. 하지만 오른쪽을 기준으로 정렬한 별을 출력하시오.
 *
 * 시간제한: 1초,  메모리 제한 128MB
 *
 * 입력: 첫째 줄에 N(1<= N <= 100)이 주어진다.
 *
 * 출력: 첫째 줄부터 N번째 줄까지 차례대로 별을 출력한다.
 *
 *
 *
 * 예시1
 *
 * 입력: 5
 *
 * 출력:
 * *****
 *  ****
 *   ***
 *    **
 *     *
 * ================================
 * DATE        AUTHOR        NOTE
 * ================================
 * 2022-05-23   parkjungkwan  최초 생성
 */
public class 별찍기 {
}
